In [16]:
import numpy as np
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [24, 27, 22, 32],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston'],
    "Customer": [True, False, True, False]
}
df = pd.DataFrame(data)

In [17]:
df

      Name  Age         City  Customer
0    Alice   24     New York      True
1      Bob   27  Los Angeles     False
2  Charlie   22      Chicago      True
3    David   32      Houston     False

In [18]:
# new = pd.DataFrame([["Aigars", 48, "Jelgava", True],["Inese", 41, "Olaine", False]])
# new = pd.DataFrame(["Aigars", 48, "Jelgava", True])
# new = pd.DataFrame([["Aigars", 48, "Jelgava", True]])
# new = pd.DataFrame({"Name": ["Aigars"], "Age": [48], "City": ["Jelgava"], "Customer": [True]})
# new = pd.DataFrame([{"Name": "Aigars", "Age": 48, "City": "Jelgava", "Customer": True}])
# new = pd.DataFrame({"Name": "Aigars", "Age": 48, "City": "Jelgava", "Customer": True}, index=[-1])
new = pd.DataFrame([[None, None, None, None]], columns=["Name", "Age", "City", "Customer"])

In [19]:
new

   Name   Age  City Customer
0  None  None  None     None

In [20]:
df = pd.concat([df[:2], new, df[2:]])

In [21]:
df

      Name   Age         City Customer
0    Alice    24     New York     True
1      Bob    27  Los Angeles    False
0     None  None         None     None
2  Charlie    22      Chicago     True
3    David    32      Houston    False

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      4 non-null      object
 1   Age       4 non-null      object
 2   City      4 non-null      object
 3   Customer  4 non-null      object
dtypes: object(4)
memory usage: 200.0+ bytes

In [9]:
import pandas as pd
import numpy as np

def convert_pandas_to_python(value):
    """Convert a Pandas or NumPy value to a native Python type."""
    if isinstance(value, np.generic):  # Convert NumPy scalar types
        return value.item()
    elif isinstance(value, pd.Timestamp):  # Convert Pandas Timestamp to Python datetime
        return value.to_pydatetime() if not pd.isna(value) else None
    elif isinstance(value, pd.Timedelta):  # Convert Pandas Timedelta to Python timedelta
        return value.to_pytimedelta()
    elif pd.isna(value):  # Handles NaN, None, pd.NA, pd.NaT
        return None
    return value  # Return as-is for other Python-native types

# Example usage:
df = pd.DataFrame({
    'int': [np.int64(1), np.int32(2), 3],
    'float': [np.float64(1.1), np.float32(2.2), 3.3],
    'bool': [np.bool_(True), False, True],
    'date': [pd.Timestamp("2023-01-01"), pd.Timestamp("2024-02-01"), pd.NaT],
    'timedelta': [pd.Timedelta(days=1), pd.Timedelta(days=2), pd.NaT],
    'string': ['text', pd.NA, None]
})

# Example: Convert a single cell
value = df.iloc[1, 4]  # Some Pandas float64
python_value = convert_pandas_to_python(value)
print(type(python_value), python_value)  # Should be <class 'float'> 3.3

<class 'datetime.timedelta'> 2 days, 0:00:00

In [10]:
df

   int  float   bool       date timedelta string
0    1    1.1   True 2023-01-01    1 days   text
1    2    2.2  False 2024-02-01    2 days   <NA>
2    3    3.3   True        NaT       NaT   None

In [11]:
df[1:2]

   int  float   bool       date timedelta string
1    2    2.2  False 2024-02-01    2 days   <NA>